<a href="https://colab.research.google.com/github/ququlza/Database/blob/main/Midterm.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from sqlalchemy import create_engine
my_conn = create_engine("sqlite:////content/midterm.db")

In [ ]:
r_set=my_conn.execute('''
CREATE TABLE `Vehicle Assets` (
	`Vehicle Id`	VARCHAR(10)	NOT NULL,
	`Registration Id`	VARCHAR(10)	NULL,
	`Manufacturer`	VARCHAR(10)	NULL,
	`Model`	VARCHAR(10)	NULL,
	`Color`	VARCHAR(10)	NULL,
	`Current Odometer`	INT	NULL,
	`Passenger Capacity`	INT	NULL,
  PRIMARY KEY (`Vehicle Id`)
);
 ''')

In [ ]:
my_conn.execute('''
INSERT INTO `Vehicle Assets`
(`Vehicle Id`, `Registration Id`, `Manufacturer`, `Model`, `Color`, `Current Odometer`, `Passenger Capacity`) VALUES
('V1000','2001 ABC','Volvo','XC90 SE','Silver',4350,4),
('V1001','2006 AFD','Kia','K7','Black',2195,4),
('V1002','2021 AHR','Tesla','2020 F','White',509,4),
('V1003','2020 DXF','Ford','Transit','Silver',974,2);
''')

In [ ]:
r_set=my_conn.execute('''SELECT * from 'Vehicle Assets' ''');
for row in r_set:
  print(row)

('V1000', '2001 ABC', 'Volvo', 'XC90 SE', 'Silver', 4350, 4)
('V1001', '2006 AFD', 'Kia', 'K7', 'Black', 2195, 4)
('V1002', '2021 AHR', 'Tesla', '2020 F', 'White', 509, 4)
('V1003', '2020 DXF', 'Ford', 'Transit', 'Silver', 974, 2)

In [12]:
r_set=my_conn.execute('''
CREATE TABLE `MR Service` (
	`Vehicle Id`	VARCHAR(10)	NOT NULL,
	`Flag`	CHAR(1)	NOT NULL,
	`MR`	CHAR(1)	NULL,
	`Final Cost`	INT	NULL,
	`Description`	VARCHAR(100)	NULL,
	`Date`	DATE	NULL,
	`Odometer`	INT	NULL,
	PRIMARY KEY (`Vehicle Id`)
  FOREIGN KEY (`Vehicle Id`)
  REFERENCES `Vehicle Assets` (`Vehicle Id`)
);
 ''')

In [16]:
my_conn.execute('''
INSERT INTO `MR Service`
(`Vehicle Id`, `Flag`, `MR`, `Final Cost`, `Description`, `Date`, `Odometer`) VALUES
('V1000', 'N', 'M', 3000, 'Oil change', '2022-10-23', 43245),
('V1001', 'N', 'R', 2000, 'Tire change', '2022-10-23', 68749)
''')

In [18]:
my_conn.execute('''
INSERT INTO `MR Service`
(`Vehicle Id`, `Flag`) VALUES
('V1002', 'Y'),
('V1003', 'Y');
''')

In [19]:
r_set=my_conn.execute('''SELECT * from 'MR Service' ''');
for row in r_set:
  print(row)

('V1000', 'N', 'M', 3000, 'Oil change', '2022-10-23', 43245)
('V1001', 'N', 'R', 2000, 'Tire change', '2022-10-23', 68749)
('V1002', 'Y', None, None, None, None, None)
('V1003', 'Y', None, None, None, None, None)

In [23]:
r_set=my_conn.execute('''
 CREATE TABLE `Availablity` (
	`Flag`	CHAR(1)	NOT NULL,
	`Vehicle Id`	VARCHAR(10)	NOT NULL,
  PRIMARY KEY (`Flag`, `Vehicle Id`)
  FOREIGN KEY (`Vehicle Id`)
  REFERENCES `Assets` (`Vehicle Id`)
);
 ''')

In [26]:
my_conn.execute('''
INSERT INTO `Availablity`
(`Flag`, `Vehicle Id`) VALUES
('N','V1000'),
('N','V1001'),
('Y','V1002'),
('Y', 'V1003');
''')

In [27]:
r_set=my_conn.execute('''SELECT * from 'Availablity' ''');
for row in r_set:
  print(row)

('N', 'V1000')
('N', 'V1001')
('Y', 'V1002')
('Y', 'V1003')

In [28]:
r_set=my_conn.execute('''
CREATE TABLE `Officials` (
	`Country`	VARCHAR(10)	NOT NULL,
	`Language`	VARCHAR(10)	NOT NULL,
	`Booking Number`	INT	NOT NULL,
	`Name`	VARCHAR(10)	NULL,
	`Role`	VARCHAR(10)	NULL,
	`City Id`	VARCHAR(8)	NOT NULL
);
 ''')

In [29]:
my_conn.execute('''
INSERT INTO `Officials`
(`Country`, `Language`, `Booking Number`, `Name`, `Role`, `City Id`) VALUES
('Korea','KR', 1,'Son HeungMin','Manager','Jung-gu'),
('Brazil','PT', 2, 'Ronaldo','Coach','Dong-gu'),
('England','EN', 3,'Harry kane','Judge','Michuhol-gu');
''')

In [30]:
r_set=my_conn.execute('''SELECT * from 'Officials' ''');
for row in r_set:
  print(row)

('Korea', 'KR', 1, 'Son Heungmin', 'Manager', 'Jung-gu')
('Brazil', 'PT', 2, 'Ronaldo', 'Coach', 'Dong-gu')
('England', 'EN', 3, 'Harry kane', 'Judge', 'Michuhol-gu')

In [31]:
r_set=my_conn.execute('''
CREATE TABLE `Countries` (
	`Country`	VARCHAR(10)	NOT NULL,
	`Language`	VARCHAR(10)	NOT NULL,
  PRIMARY KEY (`Country`, `Language`)
);
 ''')

In [32]:
my_conn.execute('''
INSERT INTO `Countries`
(`Country`, `Language`) VALUES
('Korea','KR'),
('Brazil','PT'),
('England','EN');
''')

In [33]:
r_set=my_conn.execute('''SELECT * from 'Countries' ''');
for row in r_set:
  print(row)

('Korea', 'KR')
('Brazil', 'PT')
('England', 'EN')

In [34]:
r_set=my_conn.execute('''
CREATE TABLE `Driver` (
	`License Number`	VARCHAR(18)	NOT NULL,
	`Language`	VARCHAR(10)	NOT NULL,
	`Name`	VARCHAR(10)	NULL,
	`Clearance Level`	INT	NULL,
  PRIMARY KEY (`License Number`)
);
 ''')

In [35]:
my_conn.execute('''
INSERT INTO `Driver`
(`License Number`, `Language`, `Name`, `Clearance Level`) VALUES
('qqq11-17-174133-01','KR', 'Lee KangIn',1),
('qqq12-15-250149-01','PT', 'Picardo Kaka',2),
('qqq11-19-698734-01','EN', 'Mason Mount',3);

''')

In [36]:
r_set=my_conn.execute('''SELECT * from 'Driver' ''');
for row in r_set:
  print(row)

('qqq11-17-174133-01', 'KR', 'Lee KangIn', 1)
('qqq12-15-250149-01', 'PT', 'Picardo Kaka', 2)
('qqq11-19-698734-01', 'EN', 'Mason Mount', 3)

In [37]:
r_set=my_conn.execute('''
CREATE TABLE `FATL` (
	`License Number`	VARCHAR(18)	NOT NULL,
	`Level`	INT	NULL,
	`Qualification Date`	DATE	NULL,
   PRIMARY KEY (`License Number`)
   FOREIGN KEY (`License Number`)
  REFERENCES `Driver` (`License Number`)
);
 ''')

In [38]:
my_conn.execute('''
INSERT INTO `FATL`
(`License Number`, `Level`, `Qualification Date`) VALUES
('qqq11-17-174133-0',4, '2018-11-13'),
('qqq12-15-250149-01',1, '2022-10-23'),
('qqq11-19-698734-01',5,'2013-05-08');
''')

In [39]:
r_set=my_conn.execute('''SELECT * from 'FATL' ''');
for row in r_set:
  print(row)

('qqq11-17-174133-0', 4, '2018-11-13')
('qqq12-15-250149-01', 1, '2022-10-23')
('qqq11-19-698734-01', 5, '2013-05-08')

In [40]:
r_set=my_conn.execute('''
CREATE TABLE `STLVT` (
	`License Number`	VARCHAR(18)	NOT NULL,
	`Level`	INT	NULL,
	`Qualification Date`	DATE	NULL,
	`Certifying Authority`	VARCHAR(30)	NULL,
  PRIMARY KEY (`License Number`)
   FOREIGN KEY (`License Number`)
  REFERENCES `Driver` (`License Number`)
);
 ''')

In [41]:
my_conn.execute('''
INSERT INTO `STLVT`
(`License Number`, `Level`, `Qualification Date`,`Certifying Authority`) VALUES
('qqq11-17-174133-0',3, '2019-10-13','Local Police Station'),
('qqq12-15-250149-01',1, '2020-03-23','Foreign Police Station');
''')

In [42]:
r_set=my_conn.execute('''SELECT * from 'STLVT' ''');
for row in r_set:
  print(row)

('qqq11-17-174133-0', 3, '2019-10-13', 'Local Police Station')
('qqq12-15-250149-01', 1, '2020-03-23', 'Foreign Police Station')

In [44]:
r_set=my_conn.execute('''
CREATE TABLE `Location` (
	`Booking Number`	INT	NOT NULL,
	`Pick_UP_Location`	VARCHAR(40)	NULL,
	`Drops_Off_Location`	VARCHAR(40)	NULL,
	`Location_Type`	VARCHAR(10)	NULL,
  PRIMARY KEY (`Booking Number`)
   FOREIGN KEY (`Booking Number`)
  REFERENCES `Booking Service` (`Booking Number`)
);
 ''')

In [46]:
my_conn.execute('''
INSERT INTO `Location`
(`Booking Number`, `Pick_UP_Location`, `Drops_Off_Location`, `Location_Type`) VALUES
(1, 'Incheon International Airport', 'Yonsei University', 'University'),
(2, 'Wolmido','Incheon International Airport', 'Airport'),
(3, 'Songdo','Woninjae','Station');
''')

In [47]:
r_set=my_conn.execute('''SELECT * from 'Location' ''');
for row in r_set:
  print(row)

(1, 'Incheon International Airport', 'Yonsei University', 'University')
(2, 'Wolmido', 'Incheon International Airport', 'Airport')
(3, 'Songdo', 'Woninjae', 'Station')

In [48]:
r_set=my_conn.execute('''
CREATE TABLE `Date and Odometer` (
	`Booking Number`	INT	NOT NULL,
	`Start_Date_Time`	DATETIME	NULL,
	`End_Date_Time`	DATETIME	NULL,
	`Start_Odometer`	INT	NULL,
	`End_Odometer`	INT	NULL,
  PRIMARY KEY (`Booking Number`)
  FOREIGN KEY (`Booking Number`)
  REFERENCES `Booking Service` (`Booking Number`)
);
 ''')

In [52]:
my_conn.execute('''
INSERT INTO `Date and Odometer`
(`Booking Number`, `Start_Date_Time`, `End_Date_Time`, `Start_Odometer`, `End_Odometer`) VALUES
(1, '2022-08-09 08:00:00', '2022-08-09 10:00:00', 4569,5500),
(2, '2022-08-06 21:00:00', '2022-08-06 22:25:00', 8725,9210),
(3, '2022-07-24 12:00:00', '2022-07-24 12:30:00',519,601);
''')

In [53]:
r_set=my_conn.execute('''SELECT * from 'Date and Odometer' ''');
for row in r_set:
  print(row)

(1, '2022-08-09 08:00:00', '2022-08-09 10:00:00', 4569, 5500)
(2, '2022-08-06 21:00:00', '2022-08-06 22:25:00', 8725, 9210)
(3, '2022-07-24 12:00:00', '2022-07-24 12:30:00', 519, 601)

In [54]:
r_set=my_conn.execute('''
CREATE TABLE `Booking Service` (
	`Booking Number`	INT	NOT NULL,
	`Flag`	CHAR(1)	NOT NULL,
	`Vehicle Id`	VARCHAR(10)	NOT NULL,
	`License Number`	VARCHAR(18)	NOT NULL,
  PRIMARY KEY (`Booking Number`)
);
 ''')

In [55]:
my_conn.execute('''
INSERT INTO `Booking Service`
(`Booking Number`, `Flag`, `Vehicle Id`, `License Number`) VALUES
(1, 'Y',  'V1002', 'qqq11-17-174133-01'),
(2, 'Y', 'V1003', 'qqq12-15-250149-01');
''')

In [56]:
r_set=my_conn.execute('''SELECT * from 'Booking Service' ''');
for row in r_set:
  print(row)

(1, 'Y', 'V1002', 'qqq11-17-174133-01')
(2, 'Y', 'V1003', 'qqq12-15-250149-01')